In [9]:
import pandas as pd 
import numpy as np

常用基本功能

In [10]:
# DataFrame 创建的时候不需要指定name ，但是Series创建的是可以指定name（不是必须的）

indexs = pd.Index(data=['a', 'b', 'c', 'd'], name='name')
data = {
    'age': [1,2,3,4],
    'city': ['beijing1', 'beijing2', 'beijing3', 'beijing4'],
    'sex': ['male', 'male', 'male', 'female']
}

p1 = pd.DataFrame(data=data, index=indexs)
p1

      age      city     sex
name
a       1  beijing1    male
b       2  beijing2    male
c       3  beijing3    male
d       4  beijing4  female

In [11]:
# 查看数据的整体情况
p1.info

<bound method DataFrame.info of       age      city     sex
name
a       1  beijing1    male
b       2  beijing2    male
c       3  beijing3    male
d       4  beijing4  female>

In [12]:
# 如果数据量非常大，采用只看头部的 n 条或者尾部的 n 条
# 查看头部的 n 条数据可以使用 head 方法，
# 查看尾部的 n 条数据可以使用 tail 方法

p1.head(2)

      age      city   sex
name
a       1  beijing1  male
b       2  beijing2  male

In [14]:
p1.tail(2)

      age      city     sex
name
c       3  beijing3    male
d       4  beijing4  female

In [16]:
# Pandas 中的数据结构都有 ndarray 中的常用方法和属性，如通过 .shape 获取数据的形状，通过 .T 获取数据的转置
p1.info
p1.shape   
# (4, 3)  4行3列

(4, 3)

In [18]:
p1.T  # 通过 .T 获取数据的转置

name         a         b         c         d
age          1         2         3         4
city  beijing1  beijing2  beijing3  beijing4
sex       male      male      male    female

In [21]:
p1.values  # 获取dataframe中的原有数据  获取之后是个ndarry (多维数组)

array([[1, 'beijing1', 'male'],
       [2, 'beijing2', 'male'],
       [3, 'beijing3', 'male'],
       [4, 'beijing4', 'female']], dtype=object)

描述和统计  
查看数据的简单统计指标， 最大值， 最小值 ， 平均值， 中位数 等等

In [23]:
# 通过调用 min、mean、quantile、sum 方法可以实现最小值、平均值、中位数以及求和
p1.age.max()

4

In [24]:
p1.age.sum()

10

In [25]:
p1.age.cumsum()  # 累计求和方法

name
a     1
b     3
c     6
d    10
Name: age, dtype: int64

In [26]:
# 累计求和方法
p1.sex.cumsum()

name
a                  male
b              malemale
c          malemalemale
d    malemalemalefemale
Name: sex, dtype: object

In [27]:
# 想要一次性获取多个统计指标，只需调用 describe 方法  这些都是预设好的  
# 总数、平均数、标准差、最小值、最大值、25%/50%/75% 分位数
p1.describe()

            age
count  4.000000
mean   2.500000
std    1.290994
min    1.000000
25%    1.750000
50%    2.500000
75%    3.250000
max    4.000000

In [28]:
# 如果想要查看非数字类型的列的统计指标，可以设置 include=["object"] 来获得。
# 总数，去重后的个数、最常见的值、最常见的值的频数
p1.describe(include=["object"])

            city   sex
count          4     4
unique         4     2
top     beijing1  male
freq           1     3

In [30]:
# 统计下某列中每个值出现的次数
p1.sex.value_counts()

male      3
female    1
Name: sex, dtype: int64

In [53]:
p1['city'].value_counts()

beijing1    1
beijing3    1
beijing4    1
beijing2    1
Name: city, dtype: int64

In [55]:
# 如果想要获取某列最大值或最小值对应的索引，可以使用 idxmax 或 idxmin 方法完成。
p1.age.idxmax() 
# 这个方法只对类型为数字的有效， 字符的无效  
# p1.city.idxmax()  会报错

'd'

离散化处理  

离散化指的是将指定的数据分成多个区间
假如说要把年龄离散化， 分为4个阶段

In [51]:
pd.cut(p1.age, 4)
# cut 自动生成了等距的离散区间，如果自己想定义也是没问题的

name
a    (0.997, 1.75]
b      (1.75, 2.5]
c      (2.5, 3.25]
d      (3.25, 4.0]
Name: age, dtype: category
Categories (4, interval[float64]): [(0.997, 1.75] < (1.75, 2.5] < (2.5, 3.25] < (3.25, 4.0]]